{"class_name": "Sequential", "config": [{"class_name": "AveragePooling2D", "config": {"dim_ordering": "tf", "input_dtype": "float32", "pool_size": [2, 2], "trainable": true, "border_mode": "valid", "batch_input_shape": [null, 16, 32, 1], "strides": [2, 2], "name": "averagepooling2d_1"}}, {"class_name": "Convolution2D", "config": {"name": "conv2", "dim_ordering": "tf", "trainable": true, "subsample": [1, 1], "W_constraint": null, "bias": true, "activity_regularizer": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "nb_col": 2, "nb_row": 2, "activation": "linear", "nb_filter": 1, "border_mode": "valid"}}, {"class_name": "ELU", "config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}}, {"class_name": "MaxPooling2D", "config": {"dim_ordering": "tf", "pool_size": [2, 4], "trainable": true, "border_mode": "valid", "strides": [2, 4], "name": "maxpooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"input_dim": 9, "output_dim": 1, "trainable": true, "name": "dense_2", "bias": true, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "b_regularizer": null, "b_constraint": null, "activation": "linear", "activity_regularizer": null}}], "keras_version": "1.2.0"}